const Questions = [
    //Geography, Environment and Population (5 Questions – 10 Marks)
    //1
    {
        question: "कुन महादेशमा सबैभन्दा धेरै देशहरू छन्?",
        options: ["America","Asia","Europe","Africa"],
        answer: 3
    },
    //2
    {
        question: "नेपालको सबैभन्दा लामो नदी कुन हो?",
        options: ["कोसी","घोडाघोडी","कर्णाली","गण्डकी"],
        answer: 2
    },
    //3
    {
        question: "नेपालको प्रमुख जलवायु प्रकार कुन हो?",
        options: ["मरुभूमीय","समशीतोष्ण","उष्णकटिबन्धीय","मौसमी मानसुनी"],
        answer: 3
    },
    //4
    {
        question: "नेपालको जैविक विविधता संरक्षणको प्रमुख रणनीति के हो?",
        options: ["वृक्षारोपण","संरक्षित क्षेत्र प्रणाली","शहरीकरण","भू–उपयोग"],
        answer: 1
    },
    //5
    {
        question: "विश्व जनसंख्या दिवस कहिले मनाइन्छ?",
        options: ["जून २१","जुलाई ११","अगस्ट ५","सेप्टेम्बर १०"],
        answer: 1
    },
    // History and Culture (5 Questions – 10 Marks)
    //6
    {
        question: "नेपालको किराँत युगको सुरुवात कसले गरेका थिए?",
        options: ["झोर्हाङ","लिच्छवी","यलम्बर","पृथ्वीनारायण शाह"],
        answer: 2
    },
    //7
    {
        question: "लिच्छवीकालको प्रमुख धर्म के थियो?",
        options: ["बौद्ध","इस्लाम","हिन्दू","किराँत"],
        answer: 2
    },
    //8
    {
        question: "पृथ्वीनारायण शाहले नेपाल एकीकरण कहिले सुरु गरेका थिए?",
        options: ["१७८९ सालमा","१७९९ सालमा","१७५० सालमा","१८०१ सालमा"],
        answer: 1
    },
    //9
    {
        question: "माघे सङ्क्रान्ति कुन जातिको मुख्य पर्व हो?",
        options: ["मगर","थारु","नेवार","लिम्बु"],
        answer: 1
    },
    //10
    {
        question: "‘सत्यम शिवम् सुन्दरम्’ भनाइ कुन दर्शनसँग सम्बन्धित छ?",
        options: ["बौद्ध","इस्लाम","हिन्दू","ईसाई"],
        answer: 2
    },
    //Economic Aspect and Development (5 Questions – 10 Marks)
    //11
    {
        question: "नेपालको सकल गार्हस्थ उत्पादन (GDP) कुन सूचक हो?",
        options: ["अर्थतन्त्रको समग्र उत्पादन","राजस्व वृद्धिदर","बेरोजगारी दर","मुद्रास्फीति"],
        answer: 0
    },
    //12
    {
        question: "नेपालमा सबैभन्दा धेरै मानिस कुन क्षेत्रमा रोजगारीमा छन्?",
        options: ["उद्योग","सेवा","पर्यटन","कृषि"],
        answer: 3
    },
    //13
    {
        question: "हाल नेपालको १६औं योजनाको मुख्य लक्ष्य के हो?",
        options: ["निर्यात वृद्धि","समावेशी समृद्धि","पर्यटन प्रवर्द्धन","कर सुधार"],
        answer: 1
    },
    //14
    {
        question: "नेपालमा सबैभन्दा धेरै विदेशी सहयोग कुन क्षेत्रमा केन्द्रित छ?",
        options: ["सूचना प्रविधि","भौतिक पूर्वाधार","सैनिक","खेलकुद"],
        answer: 1
    },
    //15
    {
        question: "विदेशी लगानीको प्रमुख स्रोत कुन देश हो?",
        options: ["बंगलादेश","चीन","अमेरिका","भारत"],
        answer: 3
    },
    //Governance and Constitution (5 Questions – 10 Marks)
    //16
    {
        question: "नेपालको संविधान कुन सालमा जारी भएको हो?",
        options: ["२०७०","२०७२","२०७३","२०६३"],
        answer: 1
    },
    //17
    {
        question: "नेपालको संविधानको भाग ५ केसँग सम्बन्धित छ?",
        options: ["शिक्षा नीति","संघीय कार्यपालिका","मानव अधिकार","न्यायपालिका"],
        answer: 1
    },
    //18
    {
        question: "वयस्क मताधिकारको अर्थ के हो?",
        options: ["१८ वर्षभन्दा माथिका व्यक्तिहरूको मताधिकार","समान मताधिकार","शिक्षितको अधिकार","महिलाको अधिकार"],
        answer: 1
    },
    //19
    {
        question: "मानव अधिकारलाई के भनिन्छ?",
        options: ["सामाजिक अधिकार","कानुनी अधिकार","प्राकृतिक अधिकार","विशेषाधिकार"],
        answer: 2
    },
    //20
    {
        question: "प्रदेश र स्थानीय सरकारको व्यवस्था कुन भागमा छ?",
        options: ["भाग ४","भाग ५","भाग ७","भाग ९"],
        answer: 1
    },
    //International Affairs (5 Questions – 10 Marks)
    //21
    {
        question: "संयुक्त राष्ट्रसंघको स्थापना कहिले भएको हो?",
        options: ["१९२०","१९४५","१९५०","१९३५"],
        answer: 1
    },
    //22
    {
        question: "BIMSTEC मा नेपाल कहिले आबद्ध भयो?",
        options: ["२००४","२००४","१९९७","२००१"],
        answer: 1
    },
    //23
    {
        question: "SAARC को हालको मुख्यालय कहाँ छ?",
        options: ["भारत","श्रीलंका","नेपाल","बंगलादेश"],
        answer: 2
    },
    //24
    {
        question: "ASEAN कुन महादेशमा केन्द्रित छ?",
        options: ["दक्षिण अमेरिका","अफ्रिका","एशिया","युरोप"],
        answer: 2
    },
    //25
    {
        question: "नेपालको मुख्य व्यापारिक साझेदार राष्ट्र कुन हो?",
        options: ["अमेरिका","भारत","चीन","बङ्गलादेश"],
        answer: 1
    },
    //Science, Tech & Current Affairs (5 Questions – 10 Marks)
    //26
    {
        question: "कम्प्युटरको मस्तिष्कलाई के भनिन्छ?",
        options: ["RAM","Monitor","Mouse","CPU"],
        answer: 3
    },
    //27
    {
        question: "WHO को हालको प्रमुख को हो?",
        options: ["डा. लुकास बर्न्स","डा. केशव पाण्डे","डा. टेड्रोस अधानोम","डा. पिटर ली"],
        answer: 2
    },
    //28
    {
        question: "सौर्यमण्डलको सबैभन्दा ठूलो ग्रह कुन हो?",
        options: ["पृथ्वी","बृहस्पति","मङ्गल","शुक्र"],
        answer: 1
    },
    //29
    {
        question: "पोलियो कुन प्रकारको रोग हो?",
        options: ["ब्याक्टेरिया","भाइरस","फंगल","प्रोटोजोआ"],
        answer: 1
    },
    //30
    {
        question: "नेपालले पहिलोपटक कोरोना खोप कहिले लगायो?",
        options: ["पुस २०७७","माघ २०७७","चैत २०७६","फागुन २०७७"],
        answer: 1
    },
    //Office & Public Management (5 Questions – 10 Marks)
    //31
    {
        question: "कार्यालयको अर्थ के हो?",
        options: ["फाइल राख्ने स्थान","सूचना केन्द्र","कार्यसम्पादन गर्ने स्थान","स्टोर"],
        answer: 2
    },
    //32
    {
        question: "टिप्पणी भनेको के हो?",
        options: ["सूचना","प्रशासनिक सिफारिस","प्रेस नोट","आदेश"],
        answer: 1
    },
    //33
    {
        question: "अभिलेख व्यवस्थापनको उद्देश्य के हो?",
        options: ["कागज जलाउने","स्थान बचाउने","सूचना सुरक्षित राख्ने","तलब बुझाउने"],
        answer: 2
    },
    //34
    {
        question: "सार्वजनिक सेवाको डेलिभरी कुन तहमार्फत हुन्छ?",
        options: ["संघीय","प्रदेश","स्थानीय तह","मन्त्रालय"],
        answer: 2
    },
    //35
    {
        question: "इ-शासन भन्नाले के जनाउँछ?",
        options: ["निर्वाचन","सूचना प्रविधिको प्रयोगमार्फत शासन","आर्थिक सुधार","मानव स्रोत विकास"],
        answer: 1
    },
    // Applied Mathematics (5 Questions – 10 Marks)
    //36
    {
        question: "20% को 150 कति हो?",
        options: ["25","30","35","20"],
        answer: 1
    },
    //37
    {
        question: "12, 15 र 18 को लघुत्तम गुणनफल कति हुन्छ?",
        options: ["60","180","90","120"],
        answer: 1
    },
    //38
    {
        question: "रु 500 को 5% वार्षिक ब्याज दरमा 2 वर्षमा कति ब्याज आउँछ?",
        options: ["रु 25","रु 45","रु 50","रु 55"],
        answer: 2
    },
    //39
    {
        question: "औसत निकाल्ने सूत्र कुन हो?",
        options: ["संख्या × योग","योग × संख्या","योग / २","योग / संख्या"],
        answer: 3
    },
    //40
    {
        question: "Profit = Rs. 20 on Rs. 100 investment. Profit percent?",
        options: ["10%","20%","30%","40%"],
        answer: 1
    },
    //Public Enterprises (10 Questions – 20 Marks)
    //41
    {
        question: "सार्वजनिक संस्थान भन्नाले के बुझिन्छ?",
        options: ["निजी कम्पनी","सरकारद्वारा सञ्चालित संस्था","विदेशी सहयोग","संघसंस्था"],
        answer: 1
    },
    //42
    {
        question: "नेपालमा सार्वजनिक संस्थानको सुरुवात कहिले भयो?",
        options: ["२००७","२००९","२०१३","२०२५"],
        answer: 2
    },
    //43
    {
        question: "सार्वजनिक संस्थानहरूको प्रमुख उद्देश्य के हो?",
        options: ["नाफा कमाउने","सेवा प्रवाह गर्ने","राजनीतिक लाभ","बैंक सञ्चालन"],
        answer: 1
    },
    //44
    {
        question: "सार्वजनिक संस्थानहरूको नियामक निकाय कुन हो?",
        options: ["संसद्","नेपाल लेखा परीक्षा कार्यालय","मन्त्रालय","योजना आयोग"],
        answer: 1
    },
    //45
    {
        question: "नेपाल टेलिकम कुन क्षेत्रको सार्वजनिक संस्था हो?",
        options: ["उर्जा","सञ्चार","बैंकिङ","यातायात"],
        answer: 1
    },
    //46
    {
        question: "CSR को अर्थ के हो?",
        options: ["Cost Saving Regulation","Corporate Social Responsibility","Company Strategy Rules","Civil Service Routine"],
        answer: 1
    },
    //47
    {
        question: "सार्वजनिक संस्थामा मानव संसाधन व्यवस्थापन कसले गर्छ?",
        options: ["निजामती सेवा आयोग","मन्त्रिपरिषद्","संबन्धित बोर्ड/कार्यकारी","कर्मचारी सङ्गठन"],
        answer: 2
    },
    //48
    {
        question: "अडिटिंगको मुख्य उद्देश्य के हो?",
        options: ["कर तिर्नु","तलब निर्धारण","लेखा परीक्षण","खर्च कम गर्नु"],
        answer: 2
    },
    //49
    {
        question: "नेपाल बीमा प्राधिकरण कुन कार्यसँग सम्बन्धित छ?",
        options: ["बैंक","बीमा क्षेत्र नियमन","शिक्षा","पर्यटन"],
        answer: 1
    },
    //50
    {
        question: "Security Board of Nepal के नियमन गर्छ?",
        options: ["व्यापार","पूँजी बजार","पर्यटन","कृषक संस्था"],
        answer: 1
    }
];